// 色相環生成で使う基準色と明度ステップの固定値をまとめる。
export const FIXED_COLORS = Object.freeze({
  munsell: Object.freeze([
    '#fa6163', // 5R 6/14
    '#de4400', // 10R 5/16
    '#ff9304', // 5YR 7/14
    '#ffbd2b', // 10YR 8/12
    '#efc800', // 5Y 8/14
    '#d6d032', // 10Y 8/10
    '#80a100', // 5GY 6/10
    '#68c461', // 10GY 7/10
    '#1cc88e', // 5G 7/10
    '#00c8a2', // 10G 7/10
    '#009189', // 5BG 5/10
    '#008fa0', // 10BG 5/10
    '#00a6cd', // 5B 6/10
    '#0087ca', // 10B 5/12
    '#277dce', // 5PB 5/12
    '#948cd5', // 10PB 6/10
    '#9d63b8', // 5P 5/12
    '#c77cb6', // 10P 6/10
    '#e26e9f', // 5RP 6/12
    '#d9406c', // 10RP 5/14
  ]),
  rgb: Object.freeze([
    '#ff0000',
    '#ff4d00',
    '#ff9900',
    '#ffe600',
    '#ccff00',
    '#80ff00',
    '#33ff00',
    '#00ff1a',
    '#00ff66',
    '#00ffb3',
    '#00ffff',
    '#00b3ff',
    '#0066ff',
    '#001aff',
    '#3300ff',
    '#8000ff',
    '#cc00ff',
    '#ff00e6',
    '#ff0099',
    '#ff004d',
  ]),
  'rgb+': Object.freeze([
    '#ff0022',
    '#ff5a1f',
    '#ffa700',
    '#ffd900',
    '#e1ff00',
    '#a8ff00',
    '#52ff00',
    '#00ff47',
    '#00ff8c',
    '#00ffd0',
    '#00c8ff',
    '#00a9ff',
    '#007dff',
    '#2952ff',
    '#0018ff',
    '#7a00ff',
    '#c300ff',
    '#ff00ba',
    '#ff0088',
    '#ff0055',
  ]),
  brightness: Object.freeze([
    '#FFFFFF',
    '#E3E3E3',
    '#C6C6C6',
    '#AAAAAA',
    '#8E8E8E',
    '#717171',
    '#555555',
    '#393939',
    '#1C1C1C',
    '#000000',
  ]),
});
